# RasterLockProportions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RasterLockProportions Property
ParameterTypeId Class See Also
---
"Lock Proportions"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RasterLockProportions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RasterLockProportions As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RasterLockProportions {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace